app/views/fellowships/index.html.erb

SELECT "fellowships".* FROM "fellowships" INNER JOIN "fellowship_users" ON "fellowships"."id" = "fellowship_users"."fellowship_id" WHERE "fellowship_users"."user_id" = $1  [["user_id", 1]]
---

<% current_user.fellowships.each do |fellowship| %>

SELECT "fellowships".* FROM "fellowships"
---

      <% current_user.fellowship_users.each do |fellowship_user| %>