app/views/fellowships/show.html.erb


<% @fellowship.fellowship_users.each do |fellowship_user| %>
---
SELECT "fellowship_users".* FROM "fellowship_users" WHERE "fellowship_users"."fellowship_id" = $1  [["fellowship_id", 15]]

<h2><details>
  <summary><%= t("activerecord.attributes.fellowship.group_members") %></summary>
---
SELECT  "fellowships".* FROM "fellowships" WHERE "fellowships"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

<!-- Check-Schleife  ob User in Fellowship -->
<% current_user.fellowship_users.each do |fellowship_user| %>
---
SELECT "fellowship_users".* FROM "fellowship_users" WHERE "fellowship_users"."user_id" = $1  [["user_id", 1]]