app/controllers/account_controller.rb

UPDATE "users" SET "locale" = $1, "username" = $2, "first_name" = $3, "last_name" = $4, "phone_number" = $5, "date_of_birth" = $6, "street" = $7, "housenumber" = $8, "postal_code" = $9, "city" = $10, "state" = $11, "country" = $12, "updated_at" = $13 WHERE "users"."id" = $14
---
  def update
    @user = User.find(params[:id])
    @user.update_attribute(:avatar, params[:user][:avatar])