app/controllers/fellowships_controller.rb

  def index
    @fellowships = Fellowship.all
---
SELECT "fellowships".* FROM "fellowships"

  def create
    @fellowship = Fellowship.new(fellowship_params)

    # New Group --> Current user add to Group with Adminstatus
    if @fellowship.save
---
INSERT INTO "fellowships" ("name", "email", "description", "created_at", "clear_name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "test"], ["email", "blabla@web.de"], ["description", "hallo"], ["created_at", "2022-01-16 16:09:35.624290"], ["clear_name", false], ["updated_at", "2022-01-16 16:09:35.624290"]]

  def destroy
    @fellowship = Fellowship.find(params[:id])

    #Abfrage ob Current User = Group Owner => Nur Owner können löschen
    @fellowship.fellowship_users.each do |fellowship_user|
---
SELECT  "fellowships".* FROM "fellowships" WHERE "fellowships"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "fellowships".* FROM "fellowships" WHERE "fellowships"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

  def join
    @fellowship = Fellowship.find(params[:id])

    #If Password to join is required
    if @fellowship.join_password_required?

      #If Group Password == User entered Passwort -> Join
      if params[:password] == @fellowship.join_password
        @m = @fellowship.fellowship_users.build(:user_id => current_user.id)

        respond_to do |format|
          if @m.save
---
SELECT  "fellowships".* FROM "fellowships" WHERE "fellowships"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
INSERT INTO "fellowship_users" ("created_at", "updated_at", "fellowship_id", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-02-21 17:45:24.551651"], ["updated_at", "2022-02-21 17:45:24.551651"], ["fellowship_id", 13], ["user_id", 21]]

  def changeuserrole
    @fellowship = Fellowship.find(params[:id])
    @userid = params[:userid]
    @newrole = params[:newrole]
    @currentuser_admin = false
    @currentuser_mod = false
    @currentuser_owner = false
    @multi_owner = false

    #Rolle des aktuellen Nutzers bestimmen
    @fellowship.fellowship_users.each do |current_fellowship_user|
      if current_fellowship_user.user_id == current_user.id && current_fellowship_user.fellowship_id == @fellowship.id
        if current_fellowship_user.is_fellowship_administrator
          @currentuser_admin = true
        end
        if current_fellowship_user.is_fellowship_moderator
          @currentuser_mod = true
        end
        if current_fellowship_user.is_fellowship_owner
          @currentuser_owner = true
        end
        break
      end
    end

    # Check ob min 1 weiterer Owner vorhanden ist, wenn Rolle von aktuellen Nutzer geändert wird
    # Wenn false => Error => Es muss min. 1 Owner pro Gruppe sein
    if current_user.id.to_s == @userid && @currentuser_owner
      @fellowship.fellowship_users.each do |fellowship_user|
---
SELECT  "fellowships".* FROM "fellowships" WHERE "fellowships"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "fellowship_users".* FROM "fellowship_users" WHERE "fellowship_users"."fellowship_id" = $1  [["fellowship_id", 15]]

  def leave
    @fellowship = Fellowship.find(params[:id])
    @origin = params[:origin]
    @current_fellowship_user
    @return_message = t("activerecord.attributes.fellowship.change_role_no_owner_error").to_s
    @return_type = "alert"



    #Fellowship_User finden
    @fellowship.fellowship_users.each do |fellowship_user|

      if ( current_user.id == fellowship_user.user_id && fellowship_user.fellowship_id == @fellowship.id )
        @current_fellowship_user = fellowship_user

        #Wenn aktueller Nutzer kein Owner, dann normal weiter
        if @current_fellowship_user.is_fellowship_owner == false
          fellowship_user.destroy
---
SELECT  "fellowships".* FROM "fellowships" WHERE "fellowships"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "fellowship_users".* FROM "fellowship_users" WHERE "fellowship_users"."fellowship_id" = $1  [["fellowship_id", 15]]
DELETE FROM "fellowship_users" WHERE "fellowship_users"."id" = $1  [["id", 41]]

    def set_fellowship
      @fellowship = Fellowship.find(params[:id])
---
SELECT  "fellowships".* FROM "fellowships" WHERE "fellowships"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]