app/controllers/fellowships_controller.rb

  def update
    if @fellowship.update(fellowship_params)
---
UPDATE "fellowships" SET "updated_at" = $1 WHERE "fellowships"."id" = $2  [["updated_at", "2022-01-16 16:45:50.208302"], ["id", 2]]