app/controllers/fellowships_controller.rb

DELETE FROM "fellowship_users" WHERE "fellowship_users"."id" = $1  [["id", 41]]
---
  def kick
    @fellowship = Fellowship.find(params[:id])
    m = params[:fellowship_user_id]
    @fellowship_user = @fellowship.fellowship_users.find(m)

    @fellowship_user.destroy

SELECT  "fellowships".* FROM "fellowships" WHERE "fellowships"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
    def set_fellowship
      @fellowship = Fellowship.find(params[:id])