app/views/account/show.html.erb

              <tbody>
                <% current_user.fellowships.each do |fellowship| %>
---
SELECT "fellowships".* FROM "fellowships" INNER JOIN "fellowship_users" ON "fellowships"."id" = "fellowship_users"."fellowship_id" WHERE "fellowship_users"."user_id" = $1  [["user_id", 22]]

                    <td style='width: 15%';>
                      <% current_user.fellowship_users.each do |fellowship_user| %>
---
SELECT "fellowship_users".* FROM "fellowship_users" WHERE "fellowship_users"."user_id" = $1  [["user_id", 22]]