app/models/setting.rb

    def [](key)
      where(key: key).pluck(:value).first.presence
---
SELECT "settings"."value" FROM "settings" WHERE "settings"."key" = $1 ORDER BY "settings"."id" ASC  [["key", "feature.remote_translations"]]